Autodesk.Revit.DB.SiteLocation.GetFormatWktCoordinates
Get Coordinates in Wkt format
Since:
2018

Autodesk.Revit.DB.SiteLocation.SetGeoCoordinateSystem(System.String)
Set the geographic coordinate system for this site.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL